#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_string.random: Refreshing state... [id=sZHL]
data.archive_file.lambda_zip: Reading...
data.archive_file.layer_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=8a42fc87503ed542a35cbade99b4bf8f3c5d0a79]
aws_cloudwatch_log_group.lambda_logs: Refreshing state... [id=/aws/lambda/pastebin-sZHL]
aws_iam_policy.lambda_exec_role: Refreshing state... [id=arn:aws:iam::127449185323:policy/lambda-tf-pattern-ddb-post]
aws_sns_topic.budget_notification: Refreshing state... [id=arn:aws:sns:ca-central-1:127449185323:BudgetNotificationTopic]
aws_apigatewayv2_api.http_lambda: Refreshing state... [id=exj5m66tib]
aws_dynamodb_table.paste: Refreshing state... [id=paste]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/pastebin-sZHL]
aws_iam_role.lambda_exec: Refreshing state... [id=LambdaDdbPost]
aws_s3_bucket.lambda_bucket: Refreshing state... [id=pastebin20231223003519593600000001]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=LambdaDdbPost-20231223010623714500000001]
aws_cloudwatch_metric_alarm.budget_alarm: Refreshing state... [id=MonthlyChargeAlarm]
aws_sns_topic_subscription.email_subscription: Refreshing state... [id=arn:aws:sns:ca-central-1:127449185323:BudgetNotificationTopic:6fac9d94-197f-4a31-b6ee-8c9702c91d24]
aws_s3_bucket_ownership_controls.lambda_bucket: Refreshing state... [id=pastebin20231223003519593600000001]
aws_s3_object.this: Refreshing state... [id=src.zip]
aws_s3_bucket_acl.private_bucket: Refreshing state... [id=pastebin20231223003519593600000001,private]
data.archive_file.layer_zip: Read complete after 1s [id=633fff2bb2bd3a8ca10b5edaae927c8eed2af803]
aws_lambda_layer_version.dependencies_layer: Refreshing state... [id=arn:aws:lambda:ca-central-1:127449185323:layer:python-layer:87]
aws_lambda_function.apigw_lambda_ddb: Refreshing state... [id=pastebin-sZHL]
aws_apigatewayv2_integration.apigw_lambda: Refreshing state... [id=v3fnxm6]
aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_route.write["POST /paste"]: Refreshing state... [id=arq6oei]
aws_apigatewayv2_route.read["GET /paste/api/pastes"]: Refreshing state... [id=i7knacg]
aws_apigatewayv2_route.read["GET /paste"]: Refreshing state... [id=pd3pcd6]
aws_apigatewayv2_route.read["OPTIONS /paste"]: Refreshing state... [id=1y3pfqk]
aws_apigatewayv2_route.read["GET /paste/api"]: Refreshing state... [id=95ed56b]
aws_apigatewayv2_route.write["POST /paste/api"]: Refreshing state... [id=eicvmug]
aws_apigatewayv2_stage.default: Refreshing state... [id=$default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.apigw_lambda_ddb will be updated in-place
  ~ resource "aws_lambda_function" "apigw_lambda_ddb" {
        id                             = "pastebin-sZHL"
      ~ last_modified                  = "2024-10-13T03:35:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "Q9++I9QdQ+Amt8OkY2y0wA01W1EF24E+Y0JBSlggrcE=" -> "AJFWe6v7isluBgdfg0lP5T0PAP3kSZPqY1D2TrfojEA="
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.dependencies_layer must be replaced
-/+ resource "aws_lambda_layer_version" "dependencies_layer" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:127449185323:layer:python-layer:87" -> (known after apply)
      ~ code_sha256                 = "i3fD2njhQ0tYVvFgqTkBCGZkfwYH4spUKo7CqKsMgGg=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2024-11-09T19:18:11.748+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:127449185323:layer:python-layer:87" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:127449185323:layer:python-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "ff8819e6eff77a6e70984defaf55819e1b4346f7" -> "633fff2bb2bd3a8ca10b5edaae927c8eed2af803" # forces replacement
      ~ source_code_size            = 17547536 -> (known after apply)
      ~ version                     = "87" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_s3_object.this will be updated in-place
  ~ resource "aws_s3_object" "this" {
      ~ etag                          = "c471f9b76f232b9d50f8c43e7ce1ec46" -> "4d8e841290d869801fbe6d167c98a7a0"
        id                            = "src.zip"
        tags                          = {}
      + version_id                    = (known after apply)
        # (23 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @socraticDevBlog, Action: `pull_request`*